import React from "react";
import SliderMenu from "../misc/SliderMenu";
export default function Hires() {
    const hires = [
        // {
        //     "id": 1,
        //     "name": "سامان",
        //     "description": "تجربه من در فرازمان خیلی رازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود بعالی بود بخدا",
        //     "image": "/static/images/hires/saman.jpg",
        // },
        // {
        //     "id": 2,
        //     "name": "مهرخ",
        //     "description": "تجربه من در فرازمان خیلی عرازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود بالی بود بخدا",
        //     "image": "/static/images/hires/mahrokh.jpg",
        // },
        {
            "id": 3,
            "name": "ارشیا",
            "description": "تجربه من در فرازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود بخدا",
            "image": "/static/images/hires/arshia.jpg",
        },
        {
            "id": 3,
            "name": "ارشیا",
            "description": "تجربه من در فرازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود بخدا",
            "image": "/static/images/hires/arshia.jpg",
        },
        {
            "id": 4,
            "name": "فاطمه",
            "description": "تجربه من در فرازمان خیلی رازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود بعالی بود بخدا",
            "image": "/static/images/hires/fatemeh.jpg",
        },
        {
            "id": 5,
            "name": "آریانا",
            "description": "تجربه من در فرازمان خیلی عالی رازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود ببود بخدا",
            "image": "/static/images/hires/ariana.jpg",
        },
        {
            "id": 5,
            "name": "آریانا",
            "description": "تجربه من در فرازمان خیلی عالی رازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود برازمان خیلی عالی بود ببود بخدا",
            "image": "/static/images/hires/ariana.jpg",
        },
    ]
    return (
        <div>
            <SliderMenu title="تجربه استخدامی ها" description="" items={hires} />
        </div>
    )
}